milling/easyMillSimpleFoam/0.orig/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 -10 0); // (0 -10 0)
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    rotor
    {
        type            noSlip;
    }
    stator1_wall
    {
        type            noSlip;
    }
    stator2_wall
    {
        type            noSlip;
    }
    stator3_wall
    {
        type            noSlip;
    }
    box1_wall
    {
        type            noSlip;
    }
    box2_wall
    {
        type            noSlip;
    }
    box3_wall
    {
        type            noSlip;
    }
    nozzle_wall
    {
        type            noSlip;
    }
    axis
    {
        type            noSlip;  
    } 
    bottomEmptyFaces
    {
        type            wedge;
    }
    topEmptyFaces
    {
        type            wedge;
    }
}


// ************************************************************************* //
