milling/easyMillSimpleFoam/0.orig/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    rotor
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
152.853330092
153.02212558
154.112324747
155.967229479
156.528782527
156.919435574
156.856000147
156.86181914
...
)
;
    }
    box1_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
156.777522807
156.777697441
156.777468443
156.77763012
156.777482863
156.777676493
156.777346283
156.777578644
...
)
;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    box2_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
105
(
152.996568035
153.006501768
154.050921499
155.930035097
156.504700767
156.910868917
156.851995744
156.861422207
...
)
;
    }
    box3_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
106
(
118.964969186
145.459691029
150.679130619
152.745043256
154.432569187
155.497884771
156.263033326
156.558943381
...
)
;
    }
    stator1_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
201
(
156.777524012
156.77768767
156.777591599
156.777568138
156.777567253
156.777582956
156.777583653
156.777475714
...
)
;
    }
    stator2_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
181
(
109.427701305
104.3220402
109.424413932
104.32979025
128.942931024
118.890967648
137.815104082
101.076058459
...
)
;
    }
    stator3_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
171
(
124.458911571
93.8939062025
114.732442441
103.290901386
125.917058864
149.871569607
124.464678139
93.8954825912
...
)
;
    }
    nozzle_wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
144.987936701
153.26492585
155.695323975
156.44959744
156.647617373
156.686531835
156.692771246
156.693443566
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    axis
    {
        type            calculated;
        value           nonuniform List<scalar> 0();
    }
    bottomEmptyFaces
    {
        type            wedge;
    }
    topEmptyFaces
    {
        type            wedge;
    }
}


// ************************************************************************* //
