milling/easyMillSimpleFoam/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    rotor
    {
        type            kqRWallFunction;
        value           uniform $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    stator
    {
        type            kqRWallFunction;
        value           uniform $internalField;
    }
    nozzle
    {
        type            kqRWallFunction;
        value           uniform $internalField;
    }
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           $internalField;
    }
    axis
    {
        type            kqRWallFunction;
        value           uniform $internalField;  
    } 
    bottomEmptyFaces
    {
        type            wedge;
    }
    topEmptyFaces
    {
        type            wedge;
    }
}


// ************************************************************************* //
