milling/easyMillSimpleFoam/system/graphs
// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.
// setConfig { type midPoint; }

type            sets;
libs            (sampling);

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    type    midPoint;  // midPoint
    axis    distance;  // x, y, z, xyz
}

sets
(
    lineA
    {
        $setConfig;
        start (1.0 -0.025 0);
        end   (2.0 -0.025 0);
    }

    lineB
    {
        $setConfig;
        start (1.0 -0.05 0);
        end   (2.0 -0.05 0);
    }

    lineC
    {
        $setConfig;
        start (1.0 -0.075 0);
        end   (2.0 -0.075 0);
    }
);

//fields  (U);
fields  (turbulenceProperties:R);

// ************************************************************************* //
